Revit 2027 API
RegenerationAttribute Properties
The RegenerationAttribute type exposes the following members.
Properties
Name | Description
Option | Regeneration option.
TypeId | When implemented in a derived class, gets a unique identifier for this Attribute.
(Inherited from Attribute)
Top
See Also
Reference
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace